ajinori3/STM32_HAL_base_library/MPU6050/Inc/MPU6050.h
#ifndef __MPU6050_H
#define __MPU6050_H
#ifdef __cplusplus
 extern "C" {
#endif

#include "main.h"
#include "string.h"
#include "math.h"

#include "stm32f1xx_hal.h"
#include "i2c.h"

#define MPU6050_AUX_VDDIO          0x01   // R/W
#define MPU6050_SMPLRT_DIV         0x19   // R/W
#define MPU6050_CONFIG             0x1A   // R/W
#define MPU6050_GYRO_CONFIG        0x1B   // R/W
#define MPU6050_ACCEL_CONFIG       0x1C   // R/W
#define MPU6050_FF_THR             0x1D   // R/W
#define MPU6050_FF_DUR             0x1E   // R/W
#define MPU6050_MOT_THR            0x1F   // R/W
#define MPU6050_MOT_DUR            0x20   // R/W
#define MPU6050_ZRMOT_THR          0x21   // R/W
#define MPU6050_ZRMOT_DUR          0x22   // R/W
#define MPU6050_FIFO_EN            0x23   // R/W
#define MPU6050_I2C_MST_CTRL       0x24   // R/W
#define MPU6050_I2C_SLV0_ADDR      0x25   // R/W
#define MPU6050_I2C_SLV0_REG       0x26   // R/W
#define MPU6050_I2C_SLV0_CTRL      0x27   // R/W
#define MPU6050_I2C_SLV1_ADDR      0x28   // R/W
#define MPU6050_I2C_SLV1_REG       0x29   // R/W
#define MPU6050_I2C_SLV1_CTRL      0x2A   // R/W
#define MPU6050_I2C_SLV2_ADDR      0x2B   // R/W
#define MPU6050_I2C_SLV2_REG       0x2C   // R/W
#define MPU6050_I2C_SLV2_CTRL      0x2D   // R/W
#define MPU6050_I2C_SLV3_ADDR      0x2E   // R/W
#define MPU6050_I2C_SLV3_REG       0x2F   // R/W
#define MPU6050_I2C_SLV3_CTRL      0x30   // R/W
#define MPU6050_I2C_SLV4_ADDR      0x31   // R/W
#define MPU6050_I2C_SLV4_REG       0x32   // R/W
#define MPU6050_I2C_SLV4_DO        0x33   // R/W
#define MPU6050_I2C_SLV4_CTRL      0x34   // R/W
#define MPU6050_I2C_SLV4_DI        0x35   // R  
#define MPU6050_I2C_MST_STATUS     0x36   // R
#define MPU6050_INT_PIN_CFG        0x37   // R/W
#define MPU6050_INT_ENABLE         0x38   // R/W
#define MPU6050_INT_STATUS         0x3A   // R  
#define MPU6050_ACCEL_XOUT_H       0x3B   // R  
#define MPU6050_ACCEL_XOUT_L       0x3C   // R  
#define MPU6050_ACCEL_YOUT_H       0x3D   // R  
#define MPU6050_ACCEL_YOUT_L       0x3E   // R  
#define MPU6050_ACCEL_ZOUT_H       0x3F   // R  
#define MPU6050_ACCEL_ZOUT_L       0x40   // R  
#define MPU6050_TEMP_OUT_H         0x41   // R  
#define MPU6050_TEMP_OUT_L         0x42   // R  
#define MPU6050_GYRO_XOUT_H        0x43   // R  
#define MPU6050_GYRO_XOUT_L        0x44   // R  
#define MPU6050_GYRO_YOUT_H        0x45   // R  
#define MPU6050_GYRO_YOUT_L        0x46   // R  
#define MPU6050_GYRO_ZOUT_H        0x47   // R  
#define MPU6050_GYRO_ZOUT_L        0x48   // R  
#define MPU6050_EXT_SENS_DATA_00   0x49   // R  
#define MPU6050_EXT_SENS_DATA_01   0x4A   // R  
#define MPU6050_EXT_SENS_DATA_02   0x4B   // R  
#define MPU6050_EXT_SENS_DATA_03   0x4C   // R  
#define MPU6050_EXT_SENS_DATA_04   0x4D   // R  
#define MPU6050_EXT_SENS_DATA_05   0x4E   // R  
#define MPU6050_EXT_SENS_DATA_06   0x4F   // R  
#define MPU6050_EXT_SENS_DATA_07   0x50   // R  
#define MPU6050_EXT_SENS_DATA_08   0x51   // R  
#define MPU6050_EXT_SENS_DATA_09   0x52   // R  
#define MPU6050_EXT_SENS_DATA_10   0x53   // R  
#define MPU6050_EXT_SENS_DATA_11   0x54   // R  
#define MPU6050_EXT_SENS_DATA_12   0x55   // R  
#define MPU6050_EXT_SENS_DATA_13   0x56   // R  
#define MPU6050_EXT_SENS_DATA_14   0x57   // R  
#define MPU6050_EXT_SENS_DATA_15   0x58   // R  
#define MPU6050_EXT_SENS_DATA_16   0x59   // R  
#define MPU6050_EXT_SENS_DATA_17   0x5A   // R  
#define MPU6050_EXT_SENS_DATA_18   0x5B   // R  
#define MPU6050_EXT_SENS_DATA_19   0x5C   // R  
#define MPU6050_EXT_SENS_DATA_20   0x5D   // R  
#define MPU6050_EXT_SENS_DATA_21   0x5E   // R  
#define MPU6050_EXT_SENS_DATA_22   0x5F   // R  
#define MPU6050_EXT_SENS_DATA_23   0x60   // R  
#define MPU6050_MOT_DETECT_STATUS  0x61   // R  
#define MPU6050_I2C_SLV0_DO        0x63   // R/W
#define MPU6050_I2C_SLV1_DO        0x64   // R/W
#define MPU6050_I2C_SLV2_DO        0x65   // R/W
#define MPU6050_I2C_SLV3_DO        0x66   // R/W
#define MPU6050_I2C_MST_DELAY_CTRL 0x67   // R/W
#define MPU6050_SIGNAL_PATH_RESET  0x68   // R/W
#define MPU6050_MOT_DETECT_CTRL    0x69   // R/W
#define MPU6050_USER_CTRL          0x6A   // R/W
#define MPU6050_PWR_MGMT_1         0x6B   // R/W
#define MPU6050_PWR_MGMT_2         0x6C   // R/W
#define MPU6050_FIFO_COUNTH        0x72   // R/W
#define MPU6050_FIFO_COUNTL        0x73   // R/W
#define MPU6050_FIFO_R_W           0x74   // R/W
#define MPU6050_WHO_AM_I           0x75   // R

#define	ACCEL_X		0
#define ACCEL_Y		1
#define ACCEL_Z		2

#define GYRO_X	0
#define GYRO_Y	1
#define GYRO_Z	2

#define I2C1_RX_DMA_BUFF_SIZ	14

typedef enum AccelRange_t
{
	ACC_2G,
	ACC_4G,
	ACC_8G,
	ACC_16G
} AccelRange_t;

typedef enum GyroRange_t
{
	GYRO_250deg_s,
	GYRO_500deg_s,
	GYRO_1000deg_s,
	GYRO_2000deg_s
} GyroRange_t;


typedef struct MPU6050_t
{		
	I2C_HandleTypeDef* hi2c;	
	uint8_t dev_address;   		// [address] << 1 を格納すること
	
	uint8_t accel_scale; 		// 0 = ±2g, 1 = ±4g, 2 = ±8g, 3 = ±16g
	uint8_t gyro_scale; 		// 0 = ±250deg/s, 1 = ±500deg/s, 2 ±1000deg/s, 3 = ±2000deg/s
	
	uint16_t gyro_offset_calc_number;
		
	uint8_t rawdata_buff[I2C1_RX_DMA_BUFF_SIZ];    		//gyro, accでそれぞれ6byteずつ,temperatureで2byteで計14byte
	
	int16_t gyro_int16[3];
	int16_t accel_int16[3];
	
	float gyro_float[3];
	float accel_float[3];
	
	int16_t temperature_raw;
	
	float gyro_raw_offset[3];
	float accel_raw_offset[3];
	
	float roll, pitch, yaw;	
		
} MPU6050_t;


HAL_StatusTypeDef MPU6050_GetGyroAccelBlocking(MPU6050_t* const mpu6050);
HAL_StatusTypeDef MPU6050_GetGyroAccelDMA(MPU6050_t* const mpu6050);
HAL_StatusTypeDef MPU6050_Write1byte(MPU6050_t* const mpu6050, uint16_t memAddress, uint8_t data);
HAL_StatusTypeDef MPU6050_Read1byte(MPU6050_t* const mpu6050, uint16_t memAddress, uint8_t* rxBuff);

void MPU6050_UpdateRawData(MPU6050_t* const mpu6050);
void MPU6050_CalcFloatData(MPU6050_t* const mpu6050);
HAL_StatusTypeDef MPU6050_Init(MPU6050_t* mpu6050, I2C_HandleTypeDef *hi2c, uint8_t devAddress, GyroRange_t gyroScale, AccelRange_t accelScale);
HAL_StatusTypeDef MPU6050_CalcGyroOffset(MPU6050_t* const mpu6050, uint16_t sample_number);
void MPU6050_SetGyroOffsetCalcSampleNumber(MPU6050_t* const mpu6050, uint16_t number);
void calcAngle_accel(MPU6050_t* const mpu6050);	 
void MPU6050_CalcRollPitchYaw(MPU6050_t* const mpu6050);
	 
	 
#ifdef __cplusplus
 {
#endif
	 
#endif